# int型(4byte)
def popcount32(x: int) -> int:
    x = (x & 0x55555555) + ((x >> 1) & 0x55555555)
    x = (x & 0x33333333) + ((x >> 2) & 0x33333333)
    x = (x & 0x0F0F0F0F) + ((x >> 4) & 0x0F0F0F0F)
    x = (x & 0x00FF00FF) + ((x >> 8) & 0x00FF00FF)
    x = (x & 0x0000FFFF) + ((x >> 16) & 0x0000FFFF)
    return x


# long型(8byte)
def popcount64(x: int) -> int:
    x = (x & 0x5555555555555555) + ((x >> 1) & 0x5555555555555555)
    x = (x & 0x3333333333333333) + ((x >> 2) & 0x3333333333333333)
    x = (x & 0x0F0F0F0F0F0F0F0F) + ((x >> 4) & 0x0F0F0F0F0F0F0F0F)
    x = (x & 0x00FF00FF00FF00FF) + ((x >> 8) & 0x00FF00FF00FF00FF)
    x = (x & 0x0000FFFF0000FFFF) + ((x >> 16) & 0x0000FFFF0000FFFF)
    x = (x & 0x00000000FFFFFFFF) + ((x >> 32) & 0x00000000FFFFFFFF)
    return x


# 例
# 0b11001011 -> 0b 11 00 10 11　2bitに分けて、それぞれ1の個数にする
# 0x55555555との&で右側にある1、シフトして&で左にある1を取り出し、足すことで1の個数になる

# 0b 11 00 10 11
# 0b 1+1 0+0 0+1 1+1
# 0b 10 00 01 10 1行目でxはこう変換される


# 0b 1000 0110 4bitにわけて、1の個数にする
# 右2つを取り出すには0x33333333と&する。左2つは2回シフトしてから&する

# 0b 1000 0110
# 0b 00+10 10+01
# 0b 0010 0011


# 0b 00100011 8bitにわける。
# 4つ取り出すには0x0f0f0f0fと&

# 0b 0011+0010
# 0b 00000101
# つまり1の数は5
